Revit 2024 API
RebarHandleNameData Class
 This class is used to contain the information about the rebar handle name defined by an external application.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class RebarHandleNameData : IDisposable
Visual Basic
Public Class RebarHandleNameData _
	Implements IDisposable
Visual C++
public ref class RebarHandleNameData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandleNameData
See Also
RebarHandleNameData Members
Autodesk.Revit.DB.Structure Namespace